Day9: Your pandas questions answered!
1. How to keep only few columns in the CSV file.

In [3]:
import pandas as pd

In [4]:
ufo = pd.read_csv('https://bit.ly/uforeports')

In [5]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [6]:
ufo = pd.read_csv('https://bit.ly/uforeports', usecols=['City', 'State']) # Here we are only reading specific columns, we can use index values instead of name of the column 'City' 'State'
ufo.columns

Index(['City', 'State'], dtype='object')

In [7]:
ufo = pd.read_csv('https://bit.ly/uforeports', nrows=3)
ufo

          City  Colors Reported Shape Reported State             Time
0       Ithaca              NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro              NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke              NaN           OVAL    CO  2/15/1931 14:00

How do Dataframe and Series work with regards to selecting individual entries and iteration?
- For Series data set, we can iterate using a for loop as shown below.

In [8]:
for c in ufo.City:
    print(c)

Ithaca
Willingboro
Holyoke

For iterating through a dataframe, dataframe has specific methods to do that.

In [9]:
for index, row in ufo.iterrows(): # Here are grabbing the rows, and printing out the series values for City and State.
    print(index, row.City, row.State)

0 Ithaca NY
1 Willingboro NJ
2 Holyoke CO

Q: What's the best way to drop every non-numeric column from a DataFrame?

In [10]:
drinks = pd.read_csv('https://bit.ly/drinksbycountry')

In [11]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

How do I only keep numeric values?

In [15]:
import numpy as np 
drinks.select_dtypes(include=[np.number]) # Only keeps the numeric columns

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,0,0,0,0.0
1,89,132,54,4.9
2,25,0,14,0.7
3,245,138,312,12.4
4,217,57,45,5.9
...,...,...,...,...
188,333,100,3,7.7
189,111,2,1,2.0
190,6,0,0,0.1
191,32,19,4,2.5
192,64,18,4,4.7

In [17]:
drinks.select_dtypes(include=[np.number]).dtypes # Only column with the numeric values

beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
dtype: object

In the describe method's include argument we have list, which can be used for single values and multiple values.

In [21]:
drinks.describe(include=['object', 'float64']) #Here we have two filters 
drinks.describe(include=['object']) # Describes all the numeric columns

            country continent
count           193       193
unique          193         6
top     Afghanistan    Africa
freq              1        53